# Work with test data

In [25]:
import tensorflow.keras.models as md
import pandas as pd
import numpy as np
from sklearn.preprocessing import MinMaxScaler, OneHotEncoder

In [3]:
model = md.load_model("./models/titanic.keras")

In [6]:
df = pd.read_csv("./data/test.csv")

In [7]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [37]:
filter = ["PassengerId", "Pclass", "Sex", "Age", "SibSp", "Parch", "Fare", "Embarked"]
df = df[filter]
mask = ((df["Fare"] > 0) & (~df["Age"].isna()))
df = df[mask]
df.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0          892       3    male  34.5      0      0   7.8292        Q
1          893       3  female  47.0      1      0   7.0000        S
2          894       2    male  62.0      0      0   9.6875        Q
3          895       3    male  27.0      0      0   8.6625        S
4          896       3  female  22.0      1      1  12.2875        S

In [18]:
features = ["Pclass", "Sex", "Age", "Fare"]
numeric = ["Pclass", "Age", "Fare"]
categoric = ["Sex"]

x = df[features]

In [19]:
scaler = MinMaxScaler().set_output(transform="pandas")
onehot = OneHotEncoder(sparse_output = False).set_output(transform="pandas")

In [20]:
x.loc[:, numeric] = scaler.fit_transform(x[numeric])

In [21]:
x = pd.concat([x, onehot.fit_transform(x[categoric])], axis=1).drop(columns = ["Sex"])

In [22]:
x.head()

   Pclass       Age      Fare  Sex_female  Sex_male
0     1.0  0.452723  0.009149         0.0       1.0
1     1.0  0.617566  0.007521         1.0       0.0
2     0.5  0.815377  0.012799         0.0       1.0
3     1.0  0.353818  0.010786         0.0       1.0
4     1.0  0.287881  0.017905         1.0       0.0

In [26]:
predictions = np.where(model.predict(x) < 0.5, 0, 1)

11/11 [==============================] - 0s 2ms/step

In [41]:
len(df)

330

In [39]:
pd.options.display.max_rows = 999

In [42]:
df["Survived"] = predictions

In [44]:
ans = df.loc[:, ["PassengerId", "Survived"]]

In [47]:
ans.to_csv("./data/prediction.csv", index=False)